c5/src/Documents/SickLeave/SickLeave.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SickLeave</name>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.SickLeave</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Compensation</name>
    <type>
      <types>ChartOfCalculationTypesRef.Compensations</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Extension</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SeniorityAmendment</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/InformationRegisters/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Settings</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.Settings</types>
    </type>
  </resources>
  <dimensions>
    <name>Parameter</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Settings</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Employees</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Hired</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/Calculations/Calculations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Calculations</name>
  <enumValues>
    <name>Absence</name>
  </enumValues>
  <enumValues>
    <name>Amount</name>
  </enumValues>
  <enumValues>
    <name>Annual</name>
  </enumValues>
  <enumValues>
    <name>Banked</name>
  </enumValues>
  <enumValues>
    <name>BankedUse</name>
  </enumValues>
  <enumValues>
    <name>ChildCare</name>
  </enumValues>
  <enumValues>
    <name>CompensationPercent</name>
  </enumValues>
  <enumValues>
    <name>DailyPercent</name>
  </enumValues>
  <enumValues>
    <name>DayOff</name>
  </enumValues>
  <enumValues>
    <name>EveningHours</name>
  </enumValues>
  <enumValues>
    <name>ExtendedVacation</name>
  </enumValues>
  <enumValues>
    <name>ExtraChildCare</name>
  </enumValues>
  <enumValues>
    <name>FixedAmount</name>
  </enumValues>
  <enumValues>
    <name>FixedIncomeTax</name>
  </enumValues>
  <enumValues>
    <name>HolidayHours</name>
  </enumValues>
  <enumValues>
    <name>HourlyRate</name>
  </enumValues>
  <enumValues>
    <name>IncomeTax</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsurance</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsuranceEmployee</name>
  </enumValues>
  <enumValues>
    <name>MonthlyRate</name>
  </enumValues>
  <enumValues>
    <name>NightHours</name>
  </enumValues>
  <enumValues>
    <name>Overtime</name>
  </enumValues>
  <enumValues>
    <name>PaternityVacation</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>SickDays</name>
  </enumValues>
  <enumValues>
    <name>SickDaysChild</name>
  </enumValues>
  <enumValues>
    <name>SickOnlySocial</name>
  </enumValues>
  <enumValues>
    <name>SickProduction</name>
  </enumValues>
  <enumValues>
    <name>SocialInsurance</name>
  </enumValues>
  <enumValues>
    <name>SocialInsuranceEmployee</name>
  </enumValues>
  <enumValues>
    <name>Vacation</name>
  </enumValues>
  <enumValues>
    <name>VacationWithoutPay</name>
  </enumValues>
</mdclass:Enum>

c5/src/ChartsOfCharacteristicTypes/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>Settings</name>
  <type>
    <types>ChartOfAccountsRef.General</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.VAT</types>
    <types>CatalogRef.Insurance</types>
    <types>EnumRef.FuelExpenseMethods</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>150</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ClosingAdvances</name>
      <description>Closing Advances</description>
      <code>000000108</code>
    </items>
    <items>
      <name>Employees</name>
      <description>Employees</description>
      <code>000000001</code>
    </items>
    <items>
      <name>Insurance</name>
      <description>Insurance</description>
      <code>000000101</code>
    </items>
    <items>
      <name>LVI</name>
      <description>LVI</description>
      <code>000000119</code>
    </items>
    <items>
      <name>SickLeaves</name>
      <description>Sick Leaves</description>
      <code>000000132</code>
    </items>
    <items>
      <name>Waybill</name>
      <description>Waybill</description>
      <code>000000128</code>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

c5/src/Documents/SickLeave/Forms/Form/Module.bsl
&AtServer
var Env;
&AtServer
var Copy;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( isNew () ) then
		Copy = not Parameters.CopyingValue.IsEmpty ();
		DocumentForm.Init ( Object );
		fillNew ();
	endif;
	setLinks ();
	Options.Company ( ThisObject, Object.Company );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Function isNew ()
	
	return Object.Ref.IsEmpty ();
	
EndFunction

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Links show ShowLinks;
	|Extended enable filled ( Object.Employee );
	|Compensation disable Object.Extension;
	|DateStart disable Object.Extension;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( Copy ) then
		return;
	endif; 
	settings = Logins.Settings ( "Company" );
	company = settings.Company;
	Object.Company = company;
	Object.Compensation = ChartsOfCalculationTypes.Compensations.Default ( Enums.Calculations.SickDays );
	Object.SeniorityAmendment = InformationRegisters.Settings.GetLast ( , new Structure ( "Parameter", ChartsOfCharacteristicTypes.Settings.SeniorityAmendment ) ).Value;
	individual = Object.Individual;
	if ( not individual.IsEmpty () ) then
		Object.Employee = InformationRegisters.Employees.GetByIndividual ( individual, company );
	endif;
	
EndProcedure

&AtServer
Procedure setLinks ()
	
	SQL.Init ( Env );
	sqlLinks ();
	if ( Env.Selection.Count () = 0 ) then
		ShowLinks = false;
	else
		q = Env.Q;
		q.SetParameter ( "Ref", getBase ( Object.Ref ) );
		SQL.Perform ( Env );
		setURLPanel ();
	endif;
	Appearance.Apply ( ThisObject, "ShowLinks" );

EndProcedure 

&AtServer
Procedure sqlLinks ()
	
	ViewPayrolls = AccessRight ( "View", Metadata.Documents.Payroll );
	if ( not ViewPayrolls 
		or isNew () ) then
		return;
	endif; 
	s = "
	|// #Payrolls
	|select Compensations.Ref as Document, Compensations.Ref.Date as Date, Compensations.Ref.Number as Number
	|from Document.Payroll.Compensations as Compensations
	|where Compensations.Reference = &Ref
	|and Compensations.Ref.Posted
	|and not Compensations.Ref.DeletionMark
	|group by Compensations.Ref
	|order by Date
	|";
	Env.Selection.Add ( s );
	
EndProcedure 

&AtServer
Function getBase ( Ref )
	
	if ( not Ref.Extension ) then
		return Ref;		
	endif;
	return getBase ( Ref.Base );
	
EndFunction

&AtServer
Procedure setURLPanel ()
	
	parts = new Array ();
	meta = Metadata.Documents;
	parts.Add ( URLPanel.DocumentsToURL ( Env.Payrolls, meta.Payroll ) );
	s = URLPanel.Build ( parts );
	if ( s = undefined ) then
		ShowLinks = false;
	else
		ShowLinks = true;
		Links = s;
	endif; 
	
EndProcedure 

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	StandardButtons.AdjustSaving ( ThisObject, WriteParameters );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure EmployeeOnChange ( Item )
	
	applyEmployee ();
	
EndProcedure

&AtServer
Procedure applyEmployee ()
	
	Object.Extension = false;
	Object.Individual = DF.Pick ( Object.Employee, "Individual" );
	applyExtension ();
	Appearance.Apply ( ThisObject, "Object.Employee" );
	
EndProcedure

&AtServer
Procedure applyExtension ()
	
	if ( Object.Extension ) then
		setBase ();
		if ( ValueIsFilled ( Object.Base ) ) then
			Object.Compensation = Object.Base.Compensation;
			Object.DateStart = EndOfDay ( Object.Base.DateEnd ) + 1;	
		else
			Object.Extension = false;
		endif;
	endif;
	if ( not Object.Extension ) then
		Object.Base = undefined;
	endif;
	Appearance.Apply ( ThisObject, "Object.Extension" );	
	
EndProcedure

&AtServer
Procedure setBase ()
	
	q = new Query ();
	q.Text = "
	|select top 1 SickLeaves.Ref as Ref 
	|from Document.SickLeave as SickLeaves  
	|where SickLeaves.Employee = &Employee
	|and SickLeaves.DateEnd < &Date
	|and SickLeaves.Ref <> &Ref
	|order by SickLeaves.DateEnd desc
	|";
	q.SetParameter ( "Employee", Object.Employee );
	q.SetParameter ( "Date", Object.Date );
	q.SetParameter ( "Ref", Object.Ref );
	result = q.Execute ().Unload ();
	Object.Base = ? ( result.Count () = 0, undefined, result [ 0 ].Ref );
	
EndProcedure

&AtClient
Procedure ExtensionOnChange ( Item )
	
	applyExtension ();	
	
EndProcedure
